[
  {
    "id": 1,
    "title": "The Catcher in the Rye",
    "author": "Awlad Hossain",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 5.0,
    "image": "https://i.ibb.co/Q76QYzGj/thecatcherintherye-1.jpg",
    "review":"In 'The Catcher in the Rye,' we follow a disillusioned teenager’s journey through the challenges of growing up. The narrative’s raw honesty and introspective tone capture the confusion, rebellion, and vulnerability of youth. The protagonist’s unique voice invites readers to question societal norms and the loss of innocence. Its themes of alienation and the search for identity continue to resonate, making it a timeless exploration of the complexities of adolescence.", 
    "number_of_pages": 277,
    "publisher": "Little, Brown and Company",
    "year_of_publishing": 1951
  },
  {
    "id": 2,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.8,
    "image": "https://i.ibb.co/Xx3t2WgT/to-Kill-A-Mockingbird.jpg",
    "review": "To Kill a Mockingbird is a powerful narrative that examines racial injustice and moral growth through a child’s perspective. The novel’s gentle yet firm critique of prejudice, combined with its depiction of courage and compassion, creates a deeply moving story. Harper Lee’s masterful storytelling shines a light on the importance of empathy and fairness, making this classic a compelling and enduring work on human dignity and social justice.",
    "number_of_pages": 336,
    "publisher": "J.B. Lippincott & Co.",
    "year_of_publishing": 1960
  },
  {
    "id": 3,
    "title": "1984",
    "author": "George Orwell",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.7,
    "image": "https://i.ibb.co/DgYzyP8P/1984book.jpg",
    "review": "1984 presents a haunting vision of a dystopian future ruled by totalitarian control. George Orwell’s novel explores the dark consequences of mass surveillance, censorship, and the manipulation of truth. Through the eyes of Winston Smith, readers witness the struggle for individual freedom in a society that suppresses dissent. The novel’s themes of power, control, and the loss of privacy remain profoundly relevant in today’s world." , 
    "number_of_pages": 328,
    "publisher": "Secker & Warburg",
    "year_of_publishing": 1949
  },
  {
    "id": 4,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.5,
    "image": "https://i.ibb.co/Q3CyMyyL/pride-And-Prejudice.jpg",
    "review": "Pride and Prejudice is a timeless classic that delves into love, social class, and the intricacies of human relationships. Jane Austen’s wit and keen observation bring to life a world where personal integrity and romance are intertwined with societal expectations. The charming dialogue and well-drawn characters, especially Elizabeth Bennet and Mr. Darcy, continue to captivate readers with their blend of humor, passion, and insightful social commentary.",
    "number_of_pages": 279,
    "publisher": "T. Egerton, Whitehall",
    "year_of_publishing": 1813
  },
  {
    "id": 5,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.4,
    "image": "https://i.ibb.co/ycVFv2Hf/The-Great-Gatsby-Cover-1925-Retouched.jpg",
    "review": "The Great Gatsby vividly portrays the glamour and despair of the Jazz Age. F. Scott Fitzgerald’s lyrical prose paints a picture of opulence, longing, and the elusive nature of the American Dream. Through the eyes of Nick Carraway, the reader witnesses Jay Gatsby’s fervent pursuit of love and success amidst a backdrop of wealth and moral decay. The novel remains a poignant commentary on ambition, excess, and the fragile nature of hope.",
    "number_of_pages": 180,
    "publisher": "Charles Scribner's Sons",
    "year_of_publishing": 1925
  },
  {
    "id": 6,
    "title": "Moby Dick",
    "author": "Herman Melville",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.2,
    "image": "https://i.ibb.co/wZ74ff06/mobyDick.jpg",
    "review": "Moby Dick is an epic tale of obsession and the relentless pursuit of an unattainable goal. Herman Melville crafts a narrative that explores the boundaries between man and nature, as Captain Ahab becomes consumed by his desire for revenge against the white whale. Rich in symbolism and detail, the novel examines themes of fate, identity, and the human condition, making it a complex and enduring masterpiece of American literature.",
    "number_of_pages": 635,
    "publisher": "Harper & Brothers",
    "year_of_publishing": 1851
  },
  {
    "id": 7,
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.6,
    "image": "https://i.ibb.co/MDDqWbs5/The-Alchemist.jpg",
    "review": "In The Alchemist, Paulo Coelho weaves a magical story of a young shepherd named Santiago who embarks on a quest to find treasure and fulfill his destiny. The novel is an inspiring blend of spirituality and adventure, encouraging readers to listen to their hearts and pursue their personal legends. Its simple yet profound message about the journey of self-discovery continues to motivate and uplift audiences worldwide.",
    "number_of_pages": 197,
    "publisher": "HarperTorch",
    "year_of_publishing": 1988
  },
  {
    "id": 8,
    "title": "The Book Thief",
    "author": "Markus Zusak",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.9,
    "image": "https://i.ibb.co/Y7bcMFZR/the-Book-Thief.jpg",
    "review": "The Book Thief is a moving story set in Nazi Germany, narrated by Death. Markus Zusak tells the tale of a young girl who finds solace in books amid the horrors of war. The novel explores themes of love, loss, and the transformative power of words. Its poetic narrative and deep emotional impact offer a unique perspective on human resilience and the importance of compassion in dark times.",
    "number_of_pages": 552,
    "publisher": "Picador",
    "year_of_publishing": 2005
  },
  {
    "id": 9,
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.3,
    "image": "https://i.ibb.co/My3t0MHG/Brave-New-World.jpg",
    "review": "Brave New World is a visionary work that imagines a future society governed by technology and engineered conformity. Aldous Huxley challenges our notions of freedom, individuality, and happiness through a dystopian lens. The novel’s exploration of consumerism, social control, and the loss of personal identity serves as a cautionary tale about the cost of progress, leaving readers to ponder the true meaning of a fulfilling life.",
    "number_of_pages": 311,
    "publisher": "Chatto & Windus",
    "year_of_publishing": 1932
  },
  {
    "id": 10,
    "title": "Animal Farm",
    "author": "George Orwell",
    "tags": ["Young Adult", "Identity"],
    "genre": "Fiction",
    "rating": 4.5,
    "image": "https://i.ibb.co/cXYWCHMj/Animal-Farm.jpg",
    "review":"Animal Farm is a sharp and satirical allegory that uses farm animals to depict the rise and corruption of power. George Orwell’s novella illustrates how revolutionary ideals can be betrayed by those in authority, leading to a new form of tyranny. Its straightforward narrative and powerful symbolism provide an enduring critique of totalitarianism and the manipulation of truth, making it a timeless commentary on political dynamics and human nature.",
    "number_of_pages": 112,
    "publisher": "Secker & Warburg",
    "year_of_publishing": 1945
  }
]
